### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

## Player Count

* Display the total number of players

In [2]:
#calculating Player count and storing in dictionary
tp = {"Total Players" : [len(purchase_data["SN"].unique())]}

In [3]:
#creating dataframe to display player count in table
tc_frame = pd.DataFrame(tp)

In [4]:
tc_frame

   Total Players
0            576

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [5]:
#creating new dataframe to hold purchasing analysis in it's own table
purchasing_analysis = pd.DataFrame()

In [6]:
#Calculating Number of unique items
num_unique_items = len(purchase_data["Item ID"].unique())
purchasing_analysis["# of Unique Items"] = [num_unique_items] 
#Average purchase price
avg_price = purchase_data["Price"].mean()
purchasing_analysis["Average Purchase Price"] = [avg_price]
#Total Number of Purchases
total_purchases = len(purchase_data["Purchase ID"])
purchasing_analysis["Total # of Purchases"] = [total_purchases]
#Total Revenue
total_rev = purchase_data["Price"].sum()
purchasing_analysis["Total Revenue"] = [total_rev]

In [7]:
#Completed Purchasing Analysis Dataframe
purchasing_analysis

,# of Unique Items,Average Purchase Price,Total # of Purchases,Total Revenue
0,179,3.050987,780,2379.77

   Number of Unique Items Average Price Number of Purchases Total Revenue
0                     179         $3.05                 780     $2,379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [8]:
#building unique player info table for later use
player_subset = purchase_data.drop_duplicates(subset="SN", keep="first")
player_subset

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
773,773,Hala31,21,Male,19,"Pursuit, Cudgel of Necromancy",1.02
774,774,Jiskjask80,11,Male,92,Final Critic,4.19
775,775,Aethedru70,21,Female,60,Wolf,3.54
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19

In [9]:
#Creating Dataframe to hold Gender Demo and creating counts and percentages
gender_demo = pd.DataFrame(player_subset["Gender"].value_counts())
gender_demo["%"] = (gender_demo["Gender"]/player_subset["Gender"].value_counts().sum()) * 100

In [10]:
gender_demo

                       Gender          %
Male                      484  84.027778
Female                     81  14.062500
Other / Non-Disclosed      11   1.909722

                       Total Count Percentage of Players
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [11]:
#calculating counts by gender and adding to dataframe
gender_demo["Purchase Count"] = purchase_data.groupby("Gender")["Purchase ID"].count()

In [12]:
#calculating average purchase by gender and adding to dataframe
gender_demo["Average Purchase Price"] = purchase_data.groupby("Gender")["Price"].mean()

In [13]:
#calculating Total purchase price by gender 
gender_demo["Total Purchase Value"] = purchase_data.groupby("Gender")["Price"].sum()

In [14]:
#Calculating Average purchase per person by gender
gender_demo["Average Purchase Total per Person by Gender"] = gender_demo["Total Purchase Value"]/gender_demo["Gender"]

In [15]:
gender_demo

,Gender,%,Purchase Count,Average Purchase Price,Total Purchase Value,Average Purchase Total per Person by Gender
Male,484,84.027778,652,3.017853,1967.64,4.065372
Female,81,14.062500,113,3.203009,361.94,4.468395
Other / Non-Disclosed,11,1.909722,15,3.346000,50.19,4.562727

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [16]:
# creating Age Demographics table using pd.cut
bins = [0, 10, 15, 20, 25, 30, 35, 40, 100]
labels = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]
age_ranges = pd.cut(x=purchase_data["Age"], bins = bins, labels = labels, right =  False)

In [17]:
#creating dataframe to hold data while calculating and setting index as our range values
age_demo = purchase_data.set_index(age_ranges)
age_demo.index.name = "Age Ranges"

In [18]:
age_demo

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
Age Ranges,,,,,,,
20-24,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
40+,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
20-24,2,Ithergue48,24,Male,92,Final Critic,4.88
20-24,3,Chamassasya86,24,Male,100,Blindscythe,3.27
20-24,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
20-24,775,Aethedru70,21,Female,60,Wolf,3.54
20-24,776,Iral74,21,Male,164,Exiled Doomblade,1.63
20-24,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
<10,778,Sisur91,7,Male,92,Final Critic,4.19
20-24,779,Ennrian78,24,Male,50,Dawn,4.60

In [19]:
#building column of arrays containing unique players in each age bracket
ppl_in_each_age = age_demo.groupby("Age Ranges")["SN"].unique()

In [20]:
ppl_in_each_age

Age Ranges
<10      [Eusri44, Haillyrgue51, Seuthep89, Heudai45, T...
10-14    [Lirtossa84, Aeralria27, Reulae52, Zhisrisu83,...
15-19    [Idai61, Sondim73, Aidaillodeu39, Yaliru88, Ji...
20-24    [Lisim78, Ithergue48, Chamassasya86, Iskosia90...
25-29    [Lisirra87, Yasrisu92, Phaelap26, Chamirraya83...
30-34    [Chamalo71, Siala43, Idaisuir85, Iaralrgue74, ...
35-39    [Itheria73, Chanosian48, Saesrideu94, Siarithr...
40+      [Lisovynya38, Eyrian71, Jiskjask85, Isursuir31...
Name: SN, dtype: object

In [21]:
#taking the length of each array in each bracket in order to find a player count for each bucket
ppl_in_each_age = ppl_in_each_age[:].apply(lambda x: len(x))

In [22]:
ppl_in_each_age

Age Ranges
<10       17
10-14     22
15-19    107
20-24    258
25-29     77
30-34     52
35-39     31
40+       12
Name: SN, dtype: int64

In [23]:
#Calculating demographic statistics in a new summary dataframe so that things look much cleaner
age_demo_data = {"Total Count" : ppl_in_each_age, "Percentage of Players" : (ppl_in_each_age/ppl_in_each_age.sum()) * 100}
age_demographics_summary = pd.DataFrame(data = age_demo_data, index = ppl_in_each_age.index)

In [24]:
age_demographics_summary

            Total Count  Percentage of Players
Age Ranges
<10                  17               2.951389
10-14                22               3.819444
15-19               107              18.576389
20-24               258              44.791667
25-29                77              13.368056
30-34                52               9.027778
35-39                31               5.381944
40+                  12               2.083333

       Total Count Percentage of Players
<10             17                 2.95%
10-14           22                 3.82%
15-19          107                18.58%
20-24          258                44.79%
25-29           77                13.37%
30-34           52                 9.03%
35-39           31                 5.38%
40+             12                 2.08%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [25]:
#Calculating Purchase count
purchase_count = age_demo.groupby("Age Ranges")["Purchase ID"].count()
purchase_count

Age Ranges
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Purchase ID, dtype: int64

In [26]:
#Calculating average purchase price
average_purchase_price = age_demo.groupby("Age Ranges")["Price"].mean()
average_purchase_price

Age Ranges
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: Price, dtype: float64

In [27]:
#Calculating total purchase value
total_purchase_value = age_demo.groupby("Age Ranges")["Price"].sum()
total_purchase_value

Age Ranges
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [28]:
#Calculating avg total purchase per person
avg_total_ppp = total_purchase_value/ppl_in_each_age
avg_total_ppp

Age Ranges
<10      4.537059
10-14    3.762727
15-19    3.858785
20-24    4.318062
25-29    3.805195
30-34    4.115385
35-39    4.763548
40+      3.186667
dtype: float64

In [29]:
#creating a dataframe to display everything neatly
age_data = {"Purchase Count" : purchase_count, 
            "Average Purchase Price" : average_purchase_price, 
            "Total Purchase Value" : total_purchase_value, 
            "Avg Total Purchase per Person" : avg_total_ppp}
purchasing_age_summary = pd.DataFrame(data = age_data, index = avg_total_ppp.index)

In [30]:
purchasing_age_summary

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,23,3.353478,77.13,4.537059
10-14,28,2.956429,82.78,3.762727
15-19,136,3.035956,412.89,3.858785
20-24,365,3.052219,1114.06,4.318062
25-29,101,2.900990,293.00,3.805195
30-34,73,2.931507,214.00,4.115385
35-39,41,3.601707,147.67,4.763548
40+,13,2.941538,38.24,3.186667

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [31]:
#calculating the top 5 purchasers
top_purchase_value = purchase_data.groupby("SN")["Price"].sum().nlargest(5)

In [32]:
top_purchase_value

SN
Lisosia93      18.96
Idastidru52    15.45
Chamjask73     13.83
Iral74         13.62
Iskadarya95    13.10
Name: Price, dtype: float64

In [33]:
#Calculating number of purchases
top_purchase_count = purchase_data.groupby("SN")["Price"].count()

In [34]:
#Creating summary data fram to present results
top_spender_data = {"Purchase Count" : top_purchase_count,"Average Purchase Price" : top_purchase_value/top_purchase_count, "Total Purchase Value" : top_purchase_value}
top_spenders = pd.DataFrame(data = top_spender_data, index = top_purchase_value.index)

In [35]:
top_spenders

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [36]:
#gathering data for calculating top items
most_pop_items_data = purchase_data[["Item ID", "Item Name", "Price"]]

In [37]:
#using groupby on item ID and item name
grouped_items = most_pop_items_data.groupby(["Item ID", "Item Name"])

In [39]:
#Calculating purchase count
items_purchase_count = grouped_items["Price"].count()

In [40]:
items_purchase_count

Item ID  Item Name
0        Splinter                                         4
1        Crucifer                                         4
2        Verdict                                          6
3        Phantomlight                                     6
4        Bloodlord's Fetish                               5
                                                         ..
178      Oathbreaker, Last Hope of the Breaking Storm    12
179      Wolf, Promise of the Moonwalker                  6
181      Reaper's Toll                                    5
182      Toothpick                                        3
183      Dragon's Greatsword                              3
Name: Price, Length: 179, dtype: int64

In [41]:
#calculating values of item totals
items_price_total = grouped_items["Price"].sum()

In [42]:
items_price_total

Item ID  Item Name
0        Splinter                                         5.12
1        Crucifer                                        11.77
2        Verdict                                         14.88
3        Phantomlight                                    14.94
4        Bloodlord's Fetish                               8.50
                                                         ...
178      Oathbreaker, Last Hope of the Breaking Storm    50.76
179      Wolf, Promise of the Moonwalker                 26.88
181      Reaper's Toll                                    8.30
182      Toothpick                                       12.09
183      Dragon's Greatsword                              3.27
Name: Price, Length: 179, dtype: float64

In [43]:
#creating item prices from grouped data
price = items_price_total/items_purchase_count

In [44]:
#creating dictionary to store data and creating dataframe to present summary
most_pop_items_data = {"Purchase Count" : items_purchase_count, "Item Price" : price, "Total Purchase Value" : items_price_total}
most_pop_items = pd.DataFrame(data = most_pop_items_data)

In [46]:
#sorting by the top 5 purchase count
most_pop_items_sorted = most_pop_items.sort_values(["Purchase Count"], ascending = False).head(5)

In [47]:
most_pop_items_sorted

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
145,Fiery Glass Crusader,9,4.580000,41.22
132,Persuasion,9,3.221111,28.99
108,"Extraction, Quickblade Of Trembling Hands",9,3.530000,31.77

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
132,Persuasion,9,$3.22,$28.99
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [50]:
#sorting by the top 5 total purchase value
most_pop_items_sorted = most_pop_items.sort_values(["Total Purchase Value"], ascending = False).head(5)
most_pop_items_sorted

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
82,Nirvana,9,4.900000,44.10
145,Fiery Glass Crusader,9,4.580000,41.22
103,Singed Scalpel,8,4.350000,34.80

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
103,Singed Scalpel,8,$4.35,$34.80